**DAY -2 (Pandas) - Lets dig little bit**

In [320]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['titanic_test.csv', 'titanic_train.csv']

In [321]:
## reading the Input files. We can read any type of data(CSV,HTML,JSON etc)
train = pd.read_csv("../input/titanic_train.csv")
test = pd.read_csv("../input/titanic_test.csv")

In [322]:
## Just to get a feel of the train data. 
## head() displays first few rows whether tail() displays last few rows
train.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [323]:
## Just to get a feel of the test data. 
test.head()

   PassengerId  Pclass   ...    Cabin Embarked
0          892       3   ...      NaN        Q
1          893       3   ...      NaN        S
2          894       2   ...      NaN        Q
3          895       3   ...      NaN        S
4          896       3   ...      NaN        S

[5 rows x 11 columns]

In [324]:
## lets check what are the columns in Train.
print(train.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [325]:
## lets check what are the columns in Test.
print(test.columns)
## Survived column is missed. WHY?

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [326]:
## lets try to see the column details in TRAIN
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [327]:
## lets see the distribution of Target
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

##  FILTERING Based on Conditions

In [328]:
train[train['PassengerId'] == 567]

     PassengerId  Survived  Pclass    ...       Fare Cabin  Embarked
566          567         0       3    ...     7.8958   NaN         S

[1 rows x 12 columns]

In [329]:
## lets see some sample of Survived.
train[train['Survived'] == 1].head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
8            9         1       3    ...     11.1333   NaN         S
9           10         1       2    ...     30.0708   NaN         C

[5 rows x 12 columns]

## lets understand what is loc & iloc
1. Selecting data by row numbers (.iloc)
2. Selecting data by label or by a conditional statment (.loc)

In [330]:
print(train.iloc[0])
print(train.iloc[len(train) -1 ])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
PassengerId                    891
Survived                         0
Pclass                           3
Name           Dooley, Mr. Patrick
Sex                           male
Age                             32
SibSp                            0
Parch                            0
Ticket                      370376
Fare                          7.75
Cabin                          NaN
Embarked                         Q
Name: 890, dtype: object

In [331]:
## lets check the index
train.index

RangeIndex(start=0, stop=891, step=1)

In [332]:
train.loc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                           38
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [333]:
train.index

RangeIndex(start=0, stop=891, step=1)

In [334]:
### slicing with iloc
train.iloc[:3]

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S

[3 rows x 12 columns]

In [335]:
train.loc[:3]

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S

[4 rows x 12 columns]

Confused !!! Lets take an example

In [336]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])

In [337]:
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [338]:
s.iloc[:3] # slice the first three rows

49   NaN
48   NaN
47   NaN
dtype: float64

In [339]:
s.loc[:3] # slice up to and including label 3

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

Clear Now :)

## Selecting only few columns

In [340]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [341]:
train[['PassengerId','Name']].head()

   PassengerId                                               Name
0            1                            Braund, Mr. Owen Harris
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3                             Heikkinen, Miss. Laina
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5                           Allen, Mr. William Henry

**Slicing through COLUMNS**

In [342]:
train_few = train.iloc[:,0:4]

In [343]:
train_few

     PassengerId                        ...                                                                       Name
0              1                        ...                                                    Braund, Mr. Owen Harris
1              2                        ...                          Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3                        ...                                                     Heikkinen, Miss. Laina
3              4                        ...                               Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5                        ...                                                   Allen, Mr. William Henry
5              6                        ...                                                           Moran, Mr. James
6              7                        ...                                                    McCarthy, Mr. Timothy J
7              8                        ...                                             Palsson, Master. Gosta Leonard
8              9                        ...                          Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9             10                        ...                                        Nasser, Mrs. Nicholas (Adele Achem)
10            11                        ...                                            Sandstrom, Miss. Marguerite Rut
11            12                        ...                                                   Bonnell, Miss. Elizabeth
12            13                        ...                                             Saundercock, Mr. William Henry
13            14                        ...                                                Andersson, Mr. Anders Johan
14            15                        ...                                       Vestrom, Miss. Hulda Amanda Adolfina
15            16                        ...                                           Hewlett, Mrs. (Mary D Kingcome)
16            17                        ...                                                       Rice, Master. Eugene
17            18                        ...                                               Williams, Mr. Charles Eugene
18            19                        ...                          Vander Planke, Mrs. Julius (Emelia Maria Vande...
19            20                        ...                                                    Masselmani, Mrs. Fatima
20            21                        ...                                                       Fynney, Mr. Joseph J
21            22                        ...                                                      Beesley, Mr. Lawrence
22            23                        ...                                                McGowan, Miss. Anna "Annie"
23            24                        ...                                               Sloper, Mr. William Thompson
24            25                        ...                                              Palsson, Miss. Torborg Danira
25            26                        ...                          Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
26            27                        ...                                                    Emir, Mr. Farred Chehab
27            28                        ...                                             Fortune, Mr. Charles Alexander
28            29                        ...                                              O'Dwyer, Miss. Ellen "Nellie"
29            30                        ...                                                        Todoroff, Mr. Lalio
..           ...                        ...                                                                        ...
861          862                        ...                                                Giles, Mr. Frederick Edward
862          863                        ...                          Swift, Mrs. Frederick Joel (Margaret Welles Ba...
863          864                        ...                                          Sage, Miss. Dorothy Edith "Dolly"
864          865                        ...                                                     Gill, Mr. John William
865          866                        ...                                                   Bystrom, Mrs. (Karolina)
866          867                        ...                                               Duran y More, Miss. Asuncion
867          868                        ...                                       Roebling, Mr. Washington Augustus II
868          869                        ...                                                van Melkebeke, Mr. Philemon
869          870                        ...                                            Johnson, Master. Harold Theodor
870          871                        ...                                                          Balkic, Mr. Cerin
871          872                        ...                           Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872          873                        ...                                                   Carlsson, Mr. Frans Olof
873          874                        ...                                                Vander Cruyssen, Mr. Victor
874          875                        ...                                      Abelson, Mrs. Samuel (Hannah Wizosky)
875          876                        ...                                           Najib, Miss. Adele Kiamie "Jane"
876          877                        ...                                              Gustafsson, Mr. Alfred Ossian
877          878                        ...                                                       Petroff, Mr. Nedelio
878          879                        ...                                                         Laleff, Mr. Kristo
879          880                        ...                              Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880          881                        ...                               Shelley, Mrs. William (Imanita Parrish Hall)
881          882                        ...                                                         Markun, Mr. Johann
882          883                        ...                                               Dahlberg, Miss. Gerda Ulrika
883          884                        ...                                              Banfield, Mr. Frederick James
884          885                        ...                                                     Sutehall, Mr. Henry Jr
885          886                        ...                                       Rice, Mrs. William (Margaret Norton)
886          887                        ...                                                      Montvila, Rev. Juozas
887          888                        ...                                               Graham, Miss. Margaret Edith
888          889                        ...                                   Johnston, Miss. Catherine Helen "Carrie"
889          890                        ...                                                      Behr, Mr. Karl Howell
890          891                        ...                                                        Dooley, Mr. Patrick

[891 rows x 4 columns]

## Lets understand Group By

In [344]:
## how many Male & Female survived
train[train['Survived'] == 1].groupby(['Sex'])['Survived'].count()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [345]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [346]:
## group by Embrked

In [347]:
train[train['Survived'] == 1].groupby(['Embarked'])['Survived'].count()

Embarked
C     93
Q     30
S    217
Name: Survived, dtype: int64

## lets do some operations in Columns

We'll create a function that:

Uses the pandas.fillna() method to fill all of the missing values with -0.5

Cuts the Age column into six segments:

Missing, from -1 to 0

Infant, from 0 to 5

Child, from 5 to 12

Teenager, from 12 to 18

Young Adult, from 18 to 35

Adult, from 35 to 60

Senior, from 60 to 100

In [348]:
def process_age(df,cut_points,label_names):
    df["Age"] = df["Age"].fillna(-0.5)
    df["Age_categories"] = pd.cut(df["Age"],cut_points,labels=label_names)
    return df

cut_points = [-1,0,5,12,18,35,60,100]
label_names = ["Missing","Infant","Child","Teenager","Young Adult","Adult","Senior"]

train = process_age(train,cut_points,label_names)

In [349]:
train['Age_categories'].head()

0    Young Adult
1          Adult
2    Young Adult
3    Young Adult
4    Young Adult
Name: Age_categories, dtype: category
Categories (7, object): [Missing < Infant < Child < Teenager < Young Adult < Adult < Senior]

In [350]:
### lets try Pandas Join - different example than Titanic

In [351]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_categories'],
      dtype='object')

In [352]:
## lets see how Join works

In [353]:
# lets create 2 df and join them
df1 = train[['PassengerId','Survived']]
df2 = train[['PassengerId','Name','Sex']]

In [354]:
result = pd.merge(df1,
                 df2,
                 on='PassengerId',how='inner')  
                 #on='PassengerId',how='left')  ## for left outer join - use left in how.
                 #on='PassengerId',how='right')  ## for right outer join - use right in how.

result.head()

   PassengerId   ...       Sex
0            1   ...      male
1            2   ...    female
2            3   ...    female
3            4   ...    female
4            5   ...      male

[5 rows x 4 columns]